-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 11 2019 г., 18:50
-- Версия сервера: 5.6.38
-- Версия PHP: 7.0.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `TV`
--

-- --------------------------------------------------------

--
-- Структура таблицы `DeleteAll`
--

CREATE TABLE `DeleteAll` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL,
  `item` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Все найденные значения item в строке будут удалены';

--
-- Дамп данных таблицы `DeleteAll`
--

INSERT INTO `DeleteAll` (`userID`, `id`, `item`) VALUES
(1, 1, 'акпараттык-сараптамалык багдарламасы'),
(1, 2, 'Программа'),
(1, 3, 'Ток-шоу'),
(1, 4, 'багдарламасы'),
(1, 5, ' 0+'),
(1, 6, ' 6+'),
(1, 7, ' 12+'),
(1, 8, ' 16+'),
(1, 9, ' 18+'),
(1, 10, 'Итоговая программа'),
(1, 11, '. Третий день'),
(1, 12, '. Четвёртый день'),
(1, 13, 'Тележурнал '),
(1, 14, '. 1/8 финала'),
(1, 15, '. 1/2 финала'),
(1, 16, '. 1/4 финала'),
(1, 17, '(16+)'),
(1, 18, '(ОТВ,2018)'),
(1, 19, '(12+)'),
(1, 20, '(ОТВ, 2018)'),
(1, 21, '. Прямая трансляция'),
(1, 22, '(2018, ОТВ)'),
(1, 23, 'Информационно-развлекательная программа'),
(1, 24, '(0+)'),
(1, 25, '. Период 3'),
(1, 26, '. Период 2'),
(1, 27, '. Период 1'),
(1, 28, '(ОТВ,2017)'),
(1, 29, '(6+)'),
(1, 30, '(каз/рус)'),
(1, 31, 'Премьера. '),
(1, 32, '(Сезон 2)'),
(1, 33, 'с Эдуардом Бендерским'),
(1, 34, 'с Евгением Полонским'),
(1, 35, '(Сезон2)'),
(1, 36, '()'),
(1, 37, '(каз.)'),
(1, 38, '(рус.)'),
(1, 39, 'Азiл - кулкi'),
(1, 40, '(каз)'),
(1, 41, 'с м.Оспановым'),
(1, 42, '(повтор)'),
(1, 43, 'Кулинарная программа'),
(1, 44, '(повтор вечернего выпуска)'),
(1, 45, 'Премьера!'),
(1, 46, 'Скетчком'),
(1, 47, 'багдарлама'),
(1, 48, 'тележоба'),
(1, 49, 'деректi фильмi'),
(1, 50, '3 сезон'),
(1, 51, 'Премьера '),
(1, 52, 'Ток шоу'),
(1, 53, '(каз.яз)'),
(1, 54, 'с м. Оспановым'),
(1, 55, 'с Эдом Стаффордом'),
(1, 56, 'с Сержем Марковичем'),
(1, 57, 'док.цикл'),
(1, 58, 'деректi фильм'),
(1, 59, '(6 сезон)'),
(1, 60, 'Тусаукесер!'),
(1, 61, '(кайталау)'),
(1, 62, 'Жана маусым!'),
(1, 63, 'реалити-шоу'),
(1, 64, 'Казакстан эстрада жулдыздарынын ан-шашуы'),
(1, 65, 'ток-шоу'),
(1, 66, '(ОТВ,2019)'),
(1, 67, '(2019,ОТВ)'),
(1, 68, '(ОТВ, 2019)'),
(1, 69, '(2019, ОТВ)'),
(1, 70, '(новый сезон)'),
(1, 71, 'Трансляция из Швейцарии'),
(1, 73, '1/8 финала'),
(1, 74, '1/4 финала'),
(1, 75, '1/2 финала'),
(1, 76, 'Трансляция из Красноярска'),
(1, 77, 'с Сергеем Бешенцевым'),
(1, 78, 'с Робсоном Грином'),
(1, 79, 'с Сергеем Астаховым'),
(1, 80, 'с Оливией АндриакО'),
(1, 81, 'с Александром Борисовым'),
(1, 82, '. Тiкелей эфир'),
(1, 83, 'с Нормундом Грабовскисом'),
(1, 84, 'с Александром Дунаевым');

-- --------------------------------------------------------

--
-- Структура таблицы `DeleteAllExcept`
--

CREATE TABLE `DeleteAllExcept` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL,
  `item` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Оставляемые фразы (прочее в строке будет удалено)';

--
-- Дамп данных таблицы `DeleteAllExcept`
--

INSERT INTO `DeleteAllExcept` (`userID`, `id`, `item`) VALUES
(1, 1, 'Профессиональный бокс'),
(1, 2, 'Смешанные единоборства'),
(1, 3, 'Кино в деталях'),
(1, 4, 'Радзишевский и К'),
(1, 5, '\"20:30\"'),
(1, 6, '\"7 кун\"'),
(1, 7, '\"X factor\"'),
(1, 8, '\"ГЛАВНАЯ РЕДАКЦИЯ\"'),
(1, 9, '\"Жди меня\"'),
(1, 10, '\"Любимые актеры\"'),
(1, 11, '\"ПОРТРЕТ НЕДЕЛИ\"'),
(1, 12, '\"Я стесняюсь своего тела\"'),
(1, 13, '\"Битва экстрасенсов\"'),
(1, 14, '\"Вопрос времени\"'),
(1, 15, 'В гостях у Митрофановны'),
(1, 16, 'Все на Матч!'),
(1, 17, 'Галыгин.ru'),
(1, 18, 'Дела семейные'),
(1, 19, 'Искры камина'),
(1, 20, 'Истории в деталях'),
(1, 21, 'История советской эстрады'),
(1, 22, 'Нахлыст'),
(1, 23, 'Особенности охоты'),
(1, 24, 'ОТВдетям. Мультфильмы'),
(1, 25, 'Пешком...'),
(1, 26, 'Сати. Нескучная классика'),
(1, 27, 'Сквозной эфир'),
(1, 28, 'Съешьте это немедленно!'),
(1, 29, 'Дaчныe радoсти'),
(1, 30, 'Звездное выживание'),
(1, 31, 'рыболовная лига'),
(1, 32, 'Рыболовные экспедиции'),
(1, 33, 'Зимняя рыбалка'),
(1, 34, 'Охота на оленей'),
(1, 35, '\"Избранное за неделю\"'),
(1, 36, 'Горные лыжи. Кубок мира'),
(1, 37, 'Прыжки на лыжах с трамплина. Кубок мира'),
(1, 38, 'Биатлон. Кубок мира'),
(1, 39, '\"В погоне за историей\"'),
(1, 40, 'Санный спорт. Кубок мира'),
(1, 41, 'Лыжные гонки. Кубок мира'),
(1, 42, 'Уральские пельмени'),
(1, 43, 'Прыжки с трамплина. Кубок мира'),
(1, 44, '\"Как в ресторане\"'),
(1, 45, '\"Манзара\"'),
(1, 46, '\"Оныта алмыйм\"'),
(1, 47, '\"Кел, келiнiм\"'),
(1, 48, '\"О самом главном\"'),
(1, 49, '\"60 Минут\"'),
(1, 50, 'Горная охота'),
(1, 51, '\"Непутевые заметки\"'),
(1, 52, 'Лыжное двоеборье. Чемпионат мира'),
(1, 53, 'Лёгкая атлетика. Чемпионат Европы'),
(1, 54, 'Битва ресторанов'),
(1, 55, 'Биатлон. Чемпионат Европы'),
(1, 68, 'Биатлон. Чемпионат мира'),
(1, 69, 'Спортивная гимнастика. Кубок мира'),
(1, 70, 'Кёрлинг. Чемпионат мира'),
(1, 71, '\"Попкорн\"');

-- --------------------------------------------------------

--
-- Структура таблицы `FindReplace`
--

CREATE TABLE `FindReplace` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL,
  `find_what` text NOT NULL,
  `replace_with` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `FindReplace`
--

INSERT INTO `FindReplace` (`userID`, `id`, `find_what`, `replace_with`) VALUES
(1, 1, 'Охота в Восточной Пруссии', 'В Восточной Пруссии'),
(1, 2, 'Зимняя рыбалка в Приволжье', 'Зимняя рыбалка'),
(1, 3, 'Возвращение Мухтара - 2', 'Возвращение Мухтара-2'),
(1, 4, 'Культ//Туризм', 'КультТуризм'),
(1, 5, 'ВРЕМЯ НОВОСТЕЙ', 'Время новостей'),
(1, 6, ' ХК ', ' '),
(1, 7, 'Ивановы-Ивановы комедийный сериал', 'Ивановы-Ивановы'),
(1, 8, 'Шоу \"Уральских пельменей\"', 'Уральские пельмени'),
(1, 9, 'П@утina', 'Паутина'),
(1, 10, 'Äyel siri…', 'Аyel siri'),
(1, 11, 'Подводная жизнь дельты Волги', 'Подводная жизнь Волги'),
(1, 12, '\"ДНЕВНИКИ ПУТЕШЕСТВЕННИКА\"', '\"Дневники путешественника\"'),
(1, 13, '\"BEAUTY DAY\"', '\"Beauty day\"'),
(1, 14, 'лос-анджелес', 'Лос-Анджелес'),
(1, 15, 'Коркем – фильм', 'Коркем–фильм'),
(1, 16, ' :', ':'),
(1, 17, 'ЕСТIМЕГЕН ЕЛДЕ КОП', 'Естiмеген елде коп'),
(1, 18, 'BACKSTAGE', 'Backstage'),
(1, 19, 'АЗIЛ СТУДИО', 'Азiл студио'),
(1, 20, 'Культ//туризм', 'КультТуризм'),
(1, 21, '33 квадратных метра. Дачные истории', '33 квадратных метра'),
(1, 22, 'Охотничья и рыболовная кухня', 'Кухня');

-- --------------------------------------------------------

--
-- Структура таблицы `RealNames`
--

CREATE TABLE `RealNames` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL,
  `item` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Имена собственные';

--
-- Дамп данных таблицы `RealNames`
--

INSERT INTO `RealNames` (`userID`, `id`, `item`) VALUES
(1, 1, 'ивановы'),
(1, 2, 'джерри'),
(1, 3, 'чаппи'),
(1, 4, 'боб'),
(1, 5, 'россии'),
(1, 6, 'россия'),
(1, 7, 'магикян'),
(1, 8, 'ургант'),
(1, 9, 'сюткин'),
(1, 10, 'astana'),
(1, 11, 'ричер'),
(1, 12, 'адель'),
(1, 13, 'патриарших'),
(1, 14, 'федора'),
(1, 15, 'строгова'),
(1, 16, 'артамоновой'),
(1, 17, 'ольгой'),
(1, 18, 'простоквашино'),
(1, 19, 'гуд'),
(1, 20, 'казахстан'),
(1, 21, 'машков'),
(1, 22, 'америке'),
(1, 23, 'торнберри'),
(1, 24, 'лавровой'),
(1, 25, 'федя'),
(1, 26, 'казакстан'),
(1, 27, 'мадагаскар'),
(1, 28, 'дулиттл'),
(1, 29, 'бангкок'),
(1, 30, 'холмс'),
(1, 31, 'чаннын'),
(1, 32, 'вегас'),
(1, 33, 'владимир'),
(1, 34, 'высоцкого'),
(1, 35, 'поттер'),
(1, 36, 'лещенко'),
(1, 37, 'никитич'),
(1, 38, 'горыныч'),
(1, 39, 'добрыня'),
(1, 40, 'муромец'),
(1, 41, 'бастилии'),
(1, 42, 'пореченков'),
(1, 43, 'африке'),
(1, 44, 'тайланд'),
(1, 45, 'алматы'),
(1, 46, 'карибского'),
(1, 47, 'нарнии'),
(1, 48, 'каспиан'),
(1, 49, 'персии'),
(1, 50, 'лондон'),
(1, 51, 'астана'),
(1, 52, 'оушен'),
(1, 53, 'алла'),
(1, 54, 'пугачева'),
(1, 55, 'галкин');

-- --------------------------------------------------------

--
-- Структура таблицы `Users`
--

CREATE TABLE `Users` (
  `userID` int(11) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `Users`
--

INSERT INTO `Users` (`userID`, `email`, `password`) VALUES
(1, 'media_newspaper@mail.ru', 'begemot');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `DeleteAll`
--
ALTER TABLE `DeleteAll`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `DeleteAllExcept`
--
ALTER TABLE `DeleteAllExcept`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `FindReplace`
--
ALTER TABLE `FindReplace`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `RealNames`
--
ALTER TABLE `RealNames`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `Users`
--
ALTER TABLE `Users`
  ADD PRIMARY KEY (`userID`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `DeleteAll`
--
ALTER TABLE `DeleteAll`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT для таблицы `DeleteAllExcept`
--
ALTER TABLE `DeleteAllExcept`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT для таблицы `FindReplace`
--
ALTER TABLE `FindReplace`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `RealNames`
--
ALTER TABLE `RealNames`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT для таблицы `Users`
--
ALTER TABLE `Users`
  MODIFY `userID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
