<?php

return
    [
        '~\d{1,} серия~ui',
        '~Телесериал~ui',
        '~ОТВсериал~ui',
        '~Т[/]с(ериал)? ~ui',
        '~многосерийном фильме~ui',
        '~Сериал ~u',
        '~Телехикая~ui',
        '~Многосерийный фильм~ui',
        '~многосерийного фильма~ui',
        '~в многосерийной~ui',
        '~фэнтези-сериал~ui',
        '~ сериал~ui',
        '~ Заключительная серия~ui',
        '~Заключительные серии~ui',
        '~Минисериал~ui',
        '~^сериал~ui',
        '~т\/с~ui',
        '~^cериал~ui',
        '~Семейная сага~ui',
        '~\(сериал\)~ui',
        '~Зак\. Серия~ui',
    ];