-- MySQL dump 10.13  Distrib 5.6.51, for Win64 (x86_64)
--
-- Host: localhost    Database: tv
-- ------------------------------------------------------
-- Server version	5.6.51

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `deleteall`
--

DROP TABLE IF EXISTS `deleteall`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `deleteall` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `item` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=124 DEFAULT CHARSET=utf8 COMMENT='Удаляемые фразы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `deleteall`
--

LOCK TABLES `deleteall` WRITE;
/*!40000 ALTER TABLE `deleteall` DISABLE KEYS */;
INSERT INTO `deleteall` VALUES (1,1,'акпараттык-сараптамалык багдарламасы'),(1,2,'Программа'),(1,3,'Ток-шоу'),(1,4,'багдарламасы'),(1,5,' 0+'),(1,6,' 6+'),(1,7,' 12+'),(1,8,' 16+'),(1,9,' 18+'),(1,10,'Итоговая программа'),(1,11,'. Третий день'),(1,12,'. Четвёртый день'),(1,13,'Тележурнал '),(1,14,'. 1/8 финала'),(1,15,'. 1/2 финала'),(1,16,'. 1/4 финала'),(1,17,'(16+)'),(1,18,'(ОТВ,2018)'),(1,19,'(12+)'),(1,20,'(ОТВ, 2018)'),(1,21,'. Прямая трансляция'),(1,22,'(2018, ОТВ)'),(1,23,'Информационно-развлекательная программа'),(1,24,'(0+)'),(1,25,'. Период 3'),(1,26,'. Период 2'),(1,27,'. Период 1'),(1,28,'(ОТВ,2017)'),(1,29,'(6+)'),(1,30,'(каз/рус)'),(1,31,'Премьера. '),(1,32,'(Сезон 2)'),(1,33,'с Эдуардом Бендерским'),(1,34,'с Евгением Полонским'),(1,35,'(Сезон2)'),(1,36,'()'),(1,37,'(каз.)'),(1,38,'(рус.)'),(1,39,'Азiл - кулкi'),(1,40,'(каз)'),(1,41,'с м.Оспановым'),(1,42,'(повтор)'),(1,43,'Кулинарная программа'),(1,44,'(повтор вечернего выпуска)'),(1,45,'Премьера!'),(1,46,'Скетчком'),(1,47,'багдарлама'),(1,48,'тележоба'),(1,49,'деректi фильмi'),(1,50,'3 сезон'),(1,51,'Премьера '),(1,52,'Ток шоу'),(1,53,'(каз.яз)'),(1,54,'с м. Оспановым'),(1,55,'с Эдом Стаффордом'),(1,56,'с Сержем Марковичем'),(1,57,'док.цикл'),(1,58,'деректi фильм'),(1,59,'(6 сезон)'),(1,60,'Тусаукесер!'),(1,61,'(кайталау)'),(1,62,'Жана маусым!'),(1,63,'реалити-шоу'),(1,64,'Казакстан эстрада жулдыздарынын ан-шашуы'),(1,65,'ток-шоу'),(1,66,'(ОТВ,2019)'),(1,67,'(2019,ОТВ)'),(1,68,'(ОТВ, 2019)'),(1,69,'(2019, ОТВ)'),(1,70,'(новый сезон)'),(1,71,'Трансляция из Швейцарии'),(1,73,'1/8 финала'),(1,74,'1/4 финала'),(1,75,'1/2 финала'),(1,76,'Трансляция из Красноярска'),(1,77,'с Сергеем Бешенцевым'),(1,78,'с Робсоном Грином'),(1,79,'с Сергеем Астаховым'),(1,80,'с Оливией АндриакО'),(1,81,'с Александром Борисовым'),(1,82,'. Тiкелей эфир'),(1,83,'с Нормундом Грабовскисом'),(1,84,'с Александром Дунаевым'),(1,85,'с Глебом Астафьевым'),(1,86,'с Ольгой Артамоновой'),(1,87,'коп сериялы фильм'),(1,90,'с Виталием Декабревым'),(1,91,'с Мариной Рыкалиной'),(1,92,'с Виталием Декабрёвым'),(1,93,'(каз. Новый сезон)'),(1,94,'программа'),(1,95,'(каз. Запись)'),(1,96,'(каз.Фильм – концерт. )'),(1,97,'Новый сезон!'),(1,98,', ан-шашу'),(1,99,'(ОТВ,2020)'),(1,100,'(ОТВ, 2020)'),(1,101,' нын тусаукесерi'),(1,102,'(субтитрлы)'),(1,103,'Трансляция из Москвы'),(1,104,'. Женщины'),(1,105,'. Финал'),(1,106,'. Мужчины'),(1,107,'с Павлом Стерховым'),(1,108,'[12+]'),(1,109,'[16+]'),(1,110,'с Джоэлом Ламбертом'),(1,111,'(сезон 2)'),(1,112,'с Георгием Черданцевым'),(1,113,'Трансляция из Италии'),(1,114,'(каз. повтор)'),(1,115,'(каз. Повтор)'),(1,116,'(каз. прямой эфир)'),(1,117,'(каз. Прямой эфир)'),(1,118,'(каз.Жана маусым)'),(1,119,'(каз. Жана маусым)'),(1,120,'Международный музыкальный конкурс'),(1,121,'Элеоноры Филиной'),(1,122,'Развлекательная программа'),(1,123,' c Тиной Канделаки');
/*!40000 ALTER TABLE `deleteall` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `deleteallexcept`
--

DROP TABLE IF EXISTS `deleteallexcept`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `deleteallexcept` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `item` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=90 DEFAULT CHARSET=utf8 COMMENT='Оставляемые фразы';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `deleteallexcept`
--

LOCK TABLES `deleteallexcept` WRITE;
/*!40000 ALTER TABLE `deleteallexcept` DISABLE KEYS */;
INSERT INTO `deleteallexcept` VALUES (1,1,'Профессиональный бокс'),(1,2,'Смешанные единоборства'),(1,3,'Кино в деталях'),(1,4,'Радзишевский и К'),(1,5,'\"20:30\"'),(1,6,'\"7 кун\"'),(1,7,'\"X factor\"'),(1,8,'\"ГЛАВНАЯ РЕДАКЦИЯ\"'),(1,9,'\"Жди меня\"'),(1,10,'\"Любимые актеры\"'),(1,11,'\"ПОРТРЕТ НЕДЕЛИ\"'),(1,12,'\"Я стесняюсь своего тела\"'),(1,13,'\"Битва экстрасенсов\"'),(1,14,'\"Вопрос времени\"'),(1,15,'В гостях у Митрофановны'),(1,16,'Все на Матч!'),(1,17,'Галыгин.ru'),(1,18,'Дела семейные'),(1,19,'Искры камина'),(1,20,'Истории в деталях'),(1,21,'История советской эстрады'),(1,22,'Нахлыст'),(1,23,'Особенности охоты'),(1,24,'ОТВдетям. Мультфильмы'),(1,25,'Пешком...'),(1,26,'Сати. Нескучная классика'),(1,27,'Сквозной эфир'),(1,28,'Съешьте это немедленно!'),(1,29,'Дaчныe радoсти'),(1,30,'Звездное выживание'),(1,31,'рыболовная лига'),(1,32,'Рыболовные экспедиции'),(1,33,'Зимняя рыбалка'),(1,34,'Охота на оленей'),(1,35,'\"Избранное за неделю\"'),(1,36,'Горные лыжи. Кубок мира'),(1,37,'Прыжки на лыжах с трамплина. Кубок мира'),(1,38,'Биатлон. Кубок мира'),(1,39,'\"В погоне за историей\"'),(1,40,'Санный спорт. Кубок мира'),(1,41,'Лыжные гонки. Кубок мира'),(1,42,'Уральские пельмени'),(1,43,'Прыжки с трамплина. Кубок мира'),(1,44,'\"Как в ресторане\"'),(1,45,'\"Манзара\"'),(1,46,'\"Оныта алмыйм\"'),(1,47,'\"Кел, келiнiм\"'),(1,48,'\"О самом главном\"'),(1,49,'\"60 Минут\"'),(1,50,'Горная охота'),(1,51,'\"Непутевые заметки\"'),(1,52,'Лыжное двоеборье. Чемпионат мира'),(1,53,'Лёгкая атлетика. Чемпионат Европы'),(1,54,'Битва ресторанов'),(1,55,'Биатлон. Чемпионат Европы'),(1,68,'Биатлон. Чемпионат мира'),(1,69,'Спортивная гимнастика. Кубок мира'),(1,70,'Кёрлинг. Чемпионат мира'),(1,71,'\"Попкорн\"'),(1,72,'Добрый вечер, Казахстан!'),(1,73,'Жулдызды weekend'),(1,74,'Как устроена Вселенная'),(1,75,'Жанаlike show'),(1,76,'Игра в кино'),(1,77,'Славянский базар'),(1,78,'Экстрасенсы против детективов'),(1,79,'\"Агора\"'),(1,80,'Прыжки на лыжах с трамплина'),(1,81,'Лыжные гонки'),(1,82,'Лыжный спорт'),(1,83,'Экстрасенсы детективы'),(1,85,'\"Где логика?\"'),(NULL,86,'Взгляд из-под чалмы'),(1,87,'\"Что? Где? Когда?\"'),(1,88,'\"Лучше всех\"'),(1,89,'шоу талантов центральной азии');
/*!40000 ALTER TABLE `deleteallexcept` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `findreplace`
--

DROP TABLE IF EXISTS `findreplace`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `findreplace` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `find_what` text NOT NULL,
  `replace_with` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8 COMMENT='Автозамена';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `findreplace`
--

LOCK TABLES `findreplace` WRITE;
/*!40000 ALTER TABLE `findreplace` DISABLE KEYS */;
INSERT INTO `findreplace` VALUES (1,1,'Охота в Восточной Пруссии','В Восточной Пруссии'),(1,2,'Зимняя рыбалка в Приволжье','Зимняя рыбалка'),(1,3,'Возвращение Мухтара - 2','Возвращение Мухтара-2'),(1,4,'Культ//Туризм','КультТуризм'),(1,5,'ВРЕМЯ НОВОСТЕЙ','Время новостей'),(1,6,' ХК ',' '),(1,7,'Ивановы-Ивановы комедийный сериал','Ивановы-Ивановы'),(1,8,'Шоу \"Уральских пельменей\"','Уральские пельмени'),(1,9,'П@утina','Паутина'),(1,10,'Äyel siri…','Аyel siri'),(1,11,'Подводная жизнь дельты Волги','Подводная жизнь Волги'),(1,12,'\"ДНЕВНИКИ ПУТЕШЕСТВЕННИКА\"','\"Дневники путешественника\"'),(1,13,'\"BEAUTY DAY\"','\"Beauty day\"'),(1,14,'лос-анджелес','Лос-Анджелес'),(1,15,'Коркем – фильм','Коркем–фильм'),(1,16,' :',':'),(1,17,'ЕСТIМЕГЕН ЕЛДЕ КОП','Естiмеген елде коп'),(1,18,'BACKSTAGE','Backstage'),(1,19,'АЗIЛ СТУДИО','Азiл студио'),(1,20,'Культ//туризм','КультТуризм'),(1,21,'33 квадратных метра. Дачные истории','33 квадратных метра'),(1,22,'Охотничья и рыболовная кухня','Кухня'),(1,23,'джонни инглиш','Джонни Инглиш'),(1,24,'Удивительный мир гамбола','Удивительный мир Гамбола'),(1,25,'Российская Премьер-лига','Премьер-лига'),(1,26,'китти галор','Китти Галор'),(1,27,'нур-султан','Нур-Султан'),(1,28,'Рыбалка на малых реках Удмуртии','Рыбалка на малых реках'),(1,29,'Рыболовная школа для взрослых','Рыболовная школа'),(1,30,'Тинькофф Премьер-лига','Премьер-лига'),(1,31,'беверли- хиллз','Беверли-Хиллз'),(1,32,'ö','о'),(1,33,'ń','n'),(1,34,'ǵ','g'),(1,35,'ý','у'),(1,36,'á','а'),(1,37,'Á','А'),(1,38,'Питер пэн','Питер Пэн'),(1,39,'П@утинa','Паутина'),(1,40,'ASTANA TIMES','Astana Times'),(NULL,42,' ?','?'),(NULL,43,'из под','из-под');
/*!40000 ALTER TABLE `findreplace` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `realnames`
--

DROP TABLE IF EXISTS `realnames`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `realnames` (
  `userID` int(11) DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `item` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8 COMMENT='Имена собственные';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `realnames`
--

LOCK TABLES `realnames` WRITE;
/*!40000 ALTER TABLE `realnames` DISABLE KEYS */;
INSERT INTO `realnames` VALUES (NULL,1,'иванов'),(NULL,2,'джерри'),(NULL,3,'чаппи'),(NULL,4,'боб'),(NULL,5,'россии'),(NULL,6,'россия'),(NULL,7,'магикян'),(NULL,8,'ургант'),(NULL,9,'сюткин'),(NULL,10,'astana'),(NULL,11,'ричер'),(NULL,12,'адель'),(NULL,13,'патриарших'),(NULL,14,'федора'),(NULL,15,'строгова'),(NULL,16,'артамоновой'),(NULL,17,'ольгой'),(NULL,18,'простоквашино'),(NULL,19,'гуд'),(NULL,20,'казахстан'),(NULL,21,'машков'),(NULL,22,'америке'),(NULL,23,'торнберри'),(NULL,24,'лавровой'),(NULL,25,'федя'),(NULL,26,'казакстан'),(NULL,27,'мадагаскар'),(NULL,28,'дулиттл'),(NULL,29,'бангкок'),(NULL,30,'холмс'),(NULL,31,'чаннын'),(NULL,32,'вегас'),(NULL,33,'владимир'),(NULL,34,'высоцкого'),(NULL,35,'поттер'),(NULL,36,'лещенко'),(NULL,37,'никитич'),(NULL,38,'горыныч'),(NULL,39,'добрыня'),(NULL,40,'муромец'),(NULL,41,'бастилии'),(NULL,42,'пореченков'),(NULL,43,'африке'),(NULL,44,'тайланд'),(NULL,45,'алматы'),(NULL,46,'карибского'),(NULL,47,'нарнии'),(NULL,48,'каспиан'),(NULL,49,'персии'),(NULL,50,'лондон'),(NULL,51,'астана'),(NULL,52,'оушен'),(NULL,53,'алла'),(NULL,54,'пугачева'),(NULL,55,'галкин'),(NULL,56,'царевич'),(NULL,57,'египта'),(NULL,58,'шамаханская'),(NULL,59,'элеон'),(NULL,60,'попович'),(NULL,61,'russia'),(NULL,62,'аргентина'),(NULL,63,'олимп'),(NULL,64,'васильевич'),(NULL,65,'майами'),(NULL,66,'максим'),(NULL,67,'екатерине'),(NULL,68,'катерина'),(NULL,69,'корее'),(NULL,70,'дарье'),(NULL,71,'климовой'),(NULL,72,'джейсон'),(NULL,73,'паддингтон'),(1,74,'дмитрием'),(1,75,'дибровым'),(1,76,'артур'),(1,77,'борн'),(NULL,78,'пелагеи'),(NULL,79,'лара'),(NULL,80,'крофт'),(NULL,81,'сникет'),(NULL,82,'азии'),(NULL,83,'майк'),(NULL,84,'риддик'),(NULL,85,'дэйв'),(NULL,86,'кузьмин');
/*!40000 ALTER TABLE `realnames` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `userID` int(11) NOT NULL AUTO_INCREMENT,
  `email` varchar(100) NOT NULL,
  `password` varchar(30) NOT NULL,
  PRIMARY KEY (`userID`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='Пользователь';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin@tvgrid.com','1');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-12-19 22:39:45
